src/test/resources/soap_requests/aig.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <GetUserProfileByName xmlns="http://microsoft.com/webservices/SharePointPortalServer/UserProfileService">
      <AccountName>fred's all american family feedhouse</AccountName>
    </GetUserProfileByName>
  </S:Body>
</S:Envelope>