req.sh

curl 'https://connect.exeter.edu/student/_vti_bin/UserProfileService.asmx'
 --cookie '__utma=162890472.76094276.1420605290.1421704228.1421725038.9; __utmz=162890472.1421699449.7.2.utmcsr=google|utmccn=(organic)|utmcmd=organic|utmctr=(not%20provided); ASP.NET_SessionId=jta0owahet0qtg55eqtw2d45; _ga=GA1.2.76094276.1420605290; cadataEE4350E484924E96A516CE55992E10E9="10195668f-f56d-4531-b09a-ad3181d27b5d/2y8nJJu/Ti88PzPPcDjO6dAlMHqpPD3u3uBm23/l/7rf4v5x2dPaGnbI6EB0kAdcsmiF0MW3bwL1dCtBxnWqZyXK8+UqdWOG97VzXvh1CA1Q5Kqfoq4Dsuh39amszikm7A6saNhBfhZOmpKY9EYMw=="' --data <soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'><soap:Body><GetUserProfileByName xmlns='http://microsoft.com/webservices/SharePointPortalServer/UserProfileService' ><AccountName>master\dbau</AccountName></GetUserProfileByName></soap:Body></soap:Envelope>

